In [7]:
import numpy as np
import pandas as pd

In [ ]:
# dataku = pd.DataFrame() urutannya data apa, indeks apa

In [3]:
# dataku = pd.DataFrame(np.random)

In [4]:
np.random.seed(100)

In [6]:
dataku = pd.DataFrame(np.random.randn(3,5), ['A','B','C'],['satu','dua','tiga','empat','lima'])

In [8]:
dataku

       satu       dua      tiga     empat      lima
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [11]:
dataku['dua']

A    0.342680
B    0.221180
C    0.435163
Name: dua, dtype: float64

In [12]:
type(dataku['dua'])

pandas.core.series.Series

In [13]:
#iloc Loc

In [14]:
dataku['baru'] = dataku['empat'] + dataku['lima']

In [15]:
dataku

       satu       dua      tiga     empat      lima      baru
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.065506
C -0.458027  0.435163 -0.583595  0.816847  0.672721  1.489568

In [16]:
# hapus kolom

In [31]:
dataku = dataku.drop('tiga', axis=1)

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [28]:
dataku

       satu       dua     empat      lima      baru
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [32]:
dataku.drop('baru', axis=1, inplace=True)

In [33]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
B  0.514219  0.221180 -0.189496  0.255001
C -0.458027  0.435163  0.816847  0.672721

In [34]:
dataku.drop('B', axis=0, inplace=True)

In [35]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
C -0.458027  0.435163  0.816847  0.672721

In [36]:
dataku.shape

(2, 4)

In [37]:
# proses komparasi

In [46]:
dataku < 0

   satu    dua  empat   lima
A  True  False   True  False
C  True  False  False  False

In [47]:
dataku

       satu       dua     empat      lima
A -1.749765  0.342680 -0.252436  0.981321
C -0.458027  0.435163  0.816847  0.672721

In [48]:
dataku_bol = dataku < 0

In [49]:
dataku_bol

   satu    dua  empat   lima
A  True  False   True  False
C  True  False  False  False

In [50]:
dataku[dataku_bol]

       satu  dua     empat  lima
A -1.749765  NaN -0.252436   NaN
C -0.458027  NaN       NaN   NaN

In [51]:
# yang ditunjukan cuman data < 0 yang lebih gx dlu

In [52]:
dataku[dataku<0]

       satu  dua     empat  lima
A -1.749765  NaN -0.252436   NaN
C -0.458027  NaN       NaN   NaN

In [53]:
dataku = pd.DataFrame(np.random.randn(3,5), ['A','B','C'],['satu','dua','tiga','empat','lima'])

In [54]:
dataku

       satu       dua      tiga     empat      lima
A -0.104411 -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676

In [55]:
dataku[dataku['tiga']>0]

       satu      dua      tiga     empat      lima
A -0.104411 -0.53128  1.029733 -0.438136 -1.118318
C  0.937082  0.73100  1.361556 -0.326238  0.055676

In [56]:
hasil = dataku[dataku['lima']>0]

In [57]:
hasil

       satu       dua      tiga     empat      lima
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676